{"cells":[{"attachments":{},"cell_type":"markdown","metadata":{"id":"hU_Uc7uXH7d_"},"source":["# SAM 2023 : TP Requêtes multi-sources pour l'open data\n","\n","Séances 9 et 10\n","\n","Objectif : Comprendre et réaliser des jointures entre deux sources réelles distantes lorsque l'accès aux sources est conforme aux standards de l'_open data_.\n","\n","Contexte : On considère deux sources réelles ainsi que des exemples de requêtes pouvant être posées sur chacune d'entre elles.\n","\n","On vous demande de mettre en oeuvre des scénarios de requêtes **MULTI** sources.\n"]},{"cell_type":"markdown","metadata":{"id":"1Hr9i-Fg3EJZ"},"source":["## Préparation\n","\n","**Copier** ce notebook dans votre drive et l'exécuter dans l'environnement colab de google\n"]},{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":9582,"status":"ok","timestamp":1682058990162,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"jDf3fu9UHy7i","outputId":"1fa0edd1-2918-4c88-94d2-5a42238bc974"},"outputs":[{"name":"stdout","output_type":"stream","text":["Requirement already satisfied: SPARQLWrapper in /home/aymeric/.pyenv/versions/3.10.10/lib/python3.10/site-packages (2.0.0)\n","Requirement already satisfied: rdflib>=6.1.1 in /home/aymeric/.pyenv/versions/3.10.10/lib/python3.10/site-packages (from SPARQLWrapper) (6.3.2)\n","Requirement already satisfied: isodate<0.7.0,>=0.6.0 in /home/aymeric/.pyenv/versions/3.10.10/lib/python3.10/site-packages (from rdflib>=6.1.1->SPARQLWrapper) (0.6.1)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /home/aymeric/.pyenv/versions/3.10.10/lib/python3.10/site-packages (from rdflib>=6.1.1->SPARQLWrapper) (3.0.9)\n","Requirement already satisfied: six in /home/aymeric/.pyenv/versions/3.10.10/lib/python3.10/site-packages (from isodate<0.7.0,>=0.6.0->rdflib>=6.1.1->SPARQLWrapper) (1.16.0)\n","Note: you may need to restart the kernel to use updated packages.\n"]}],"source":["%pip install SPARQLWrapper"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"U4iuSiRuvKgb"},"source":["### Manipuler le résultat d'une requête\n","\n","Fonctions **tableauResultat** pour extraire le résultat d'une requête\n"]},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1788,"status":"ok","timestamp":1682058991948,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"-aXA-jUgDCKU","outputId":"85743c2f-c92d-4ae3-d764-90cab81b329b"},"outputs":[{"name":"stdout","output_type":"stream","text":["fonctions définies\n"]}],"source":["import pandas as pd\n","\n","# pd.set_option('max_columns', None)\n","pd.set_option(\"max_colwidth\", None)\n","\n","\n","# Déterminer la liste des noms d'attributs du résultat, en tenant compte des attributs optionnels.\n","def schemaResultat(resultats, limit=100):\n","    d = {}\n","    for elt in resultats[:limit]:\n","        for pos, nom in enumerate(elt):\n","            sum_pos, nb = d.get(nom, (0, 0))\n","            d[nom] = (sum_pos + pos, nb + 1)\n","    mean_pos_by_name = [(sum_pos / nb, nom) for (nom, (sum_pos, nb)) in d.items()]\n","    colonnes = [nom for (mean_pos, nom) in sorted(mean_pos_by_name)]\n","    return colonnes\n","\n","\n","def tableauResultat(resultats, limit=100, colonnes=None):\n","    if colonnes is None:\n","        colonnes = schemaResultat(resultats, limit)\n","    tableau = []\n","    for elt in resultats[:limit]:\n","        row = {name: v.value for name, v in elt.items()}\n","        tableau.append([row.get(n, \"\") for n in colonnes])\n","    return tableau\n","\n","\n","print(\"fonctions définies\")\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"HwrY17qTKqx5"},"source":["Afficher le résultat\n"]},{"cell_type":"code","execution_count":3,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":8,"status":"ok","timestamp":1682058991948,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"5hh7i-9IKnuf","outputId":"f56596ec-49c8-456a-95e3-72677aa17f17"},"outputs":[{"name":"stdout","output_type":"stream","text":["fonctions définies\n"]}],"source":["def afficherResultat(resultats, limit=100):\n","    print(len(resultats), \"éléments\")\n","    colonnes = schemaResultat(resultats, limit)\n","    print(\"schéma: \", colonnes)\n","    result = tableauResultat(resultats, limit, colonnes)\n","    return pd.DataFrame(result, columns=colonnes)\n","\n","\n","print(\"fonctions définies\")\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"tfI9a4lklAKf"},"source":["### Importer le pilote pour accéder aux sources\n"]},{"cell_type":"code","execution_count":4,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6,"status":"ok","timestamp":1682058991949,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"kFXKS-euk4T4","outputId":"35c81121-fdaa-43ac-a8fa-7d7da82044b0"},"outputs":[{"name":"stdout","output_type":"stream","text":["pilote importé\n"]}],"source":["from SPARQLWrapper import SPARQLWrapper2\n","\n","print(\"pilote importé\")\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"wM0f7svUC2LE"},"source":["### Préparer l'accès à la source BNF\n"]},{"cell_type":"code","execution_count":5,"metadata":{"executionInfo":{"elapsed":4,"status":"ok","timestamp":1682058991949,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"0RziFSRYDBpE"},"outputs":[],"source":["# Connexion à la BNF\n","BNF = SPARQLWrapper2(\"http://data.bnf.fr/sparql\")\n","\n","BNF_prefix = \"\"\"\n","PREFIX dc: <http://purl.org/dc/terms/>\n","PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","\n","PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n","PREFIX rda: <http://rdaregistry.info/Elements/w/>\n","PREFIX owl: <http://www.w3.org/2002/07/owl#>\n","\n","PREFIX bnf: <http://data.bnf.fr/ontology/bnf-onto/>\n","\n","PREFIX bio: <http://vocab.org/bio/0.1/>\n","PREFIX voc2: <http://rdvocab.info/ElementsGr2/>\n","\"\"\"\n","# print(BNF_prefix)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"IOLb2KSfDLdR"},"source":["### Préparer l'accès à la source DBPEDIA\n"]},{"cell_type":"code","execution_count":6,"metadata":{"executionInfo":{"elapsed":4,"status":"ok","timestamp":1682058991949,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"pIJSoRGDDLdR"},"outputs":[],"source":["# Connexion à DBPEDIA France.\n","DBPEDIA = SPARQLWrapper2(\"http://fr.dbpedia.org/sparql\")\n","\n","DBPEDIA_prefix = \"\"\"\n","PREFIX dc:   <http://purl.org/dc/terms/>\n","PREFIX xsd:  <http://www.w3.org/2001/XMLSchema#>\n","\n","PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n","PREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n","PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n","\n","PREFIX dbo:  <http://dbpedia.org/ontology/>\n","\n","# Dans cette source, les noms de propriétés sont en français\n","PREFIX dbp:  <http://fr.dbpedia.org/property/>\n","\"\"\"\n","# print(DBPEDIA_prefix)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"FTXujqEYg-mv"},"source":["## Source 1 : La bibliothèque BNF\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"TgJO3oVK40yT"},"source":["### BNF P1: Le nom des personnes\n","\n","On suppose les relations :\n","\n","- **CrééPar**(ouvrage, auteur)\n","- **Nom**(auteur, nom)\n","\n","En SQL, la requête s'exprimerait ainsi:\n","\n","> select distinct n.nom\n","\n","> from CrééPar c, Nom n\n","\n","> where c.auteur = n.auteur\n"]},{"cell_type":"code","execution_count":7,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1223,"status":"ok","timestamp":1682058993168,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"W7NBgmGq5P_b","outputId":"f4a83dcf-2ede-44b1-f248-894f79ec4c75"},"outputs":[{"name":"stdout","output_type":"stream","text":["['Fernand Gilles Lagrange']\n","['Musée des beaux-arts. Rouen']\n","['Château-Musée. Dieppe, Seine-Maritime']\n","['Évelyne Brisou-Pellen']\n","['Philippe Delestre']\n"]}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom\n","WHERE {\n","  ?ouvrage dc:creator ?auteur .       # un ouvrage est créé par au moins un auteur\n","  ?auteur foaf:name ?nom              # un auteur a un nom\n","}\n","LIMIT 5\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","for r in tableauResultat(resultats):\n","    print(r)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"M0qSrFgKhHS2"},"source":["### BNF T1: liste de thèmes\n","\n","#### Les _themes_ des oeuvres dont l'auteur est référencé dans dbpedia france\n","\n","En SQL, cette requête pourrait s'exprimer sur les tables suivantes\n","\n","**créé_par** (livre, auteur)\n","\n","**type_d_expression** (livre, type_expre) -- exple de tpye d'expression: textuelle\n","\n","**écrit_en** (livre, langue)\n","\n","**sujet** (livre, thème)\n","\n","**auteur_équivalent** (auteur, auteur_source2)\n","\n","et une condition SQL serait : WHERE auteur_source2 like 'http://fr.dbpedia.org%'\n"]},{"cell_type":"code","execution_count":8,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":84},"executionInfo":{"elapsed":766,"status":"ok","timestamp":1682058993931,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"RI4C0Q9hhRe9","outputId":"6b5671a8-35d9-4c25-fe76-eaaf85360c37"},"outputs":[{"name":"stdout","output_type":"stream","text":["0 éléments\n","schéma:  []\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["Empty DataFrame\n","Columns: []\n","Index: []"]},"execution_count":8,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?theme\n","WHERE {\n","  \n","  # une oeuvre est associée a (au moins) un auteur\n","  ?livre dc:creator ?auteur .\n","\n","  # un livre est un ouvrage dont la forme d'expression est textuelle (te)\n","  ?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","  \n","  # livre écrit en langue française\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le livre a au moins un theme\n","  ?livre bnf:subject ?theme.\n","\n","  # l'auteur existe également dans une autre source,\n","  # on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  # la référence externe \"pointe\" vers dbpedia\n","  FILTER ( regex(?auteurDbpedia, \"http://fr.dbpedia.org\")  )\n"," \n","}\n","ORDER BY ?theme\n","LIMIT 20\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)\n","\n","# Exemple:\n","# Informatique\n","# Langues\n","# Philosophie\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"K5mu8CL-H2Qo"},"source":["### BNF A1 : une liste d'auteurs\n","\n","A1 : Liste des auteurs de livres écrits en français et nés pendant une certaine période, par exemple au 20eme siècle. Afficher le nom de l'auteur, son année et lieu de naissance.\n"]},{"cell_type":"code","execution_count":9,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":711},"executionInfo":{"elapsed":1188,"status":"ok","timestamp":1682058995116,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"JG98_IoJIX0s","outputId":"20204c8d-e05d-4d51-bdf2-8efdf2292551"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['nom', 'naissance', 'lieu']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>lieu</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Nardo Zalko</td>\n","      <td>1941</td>\n","      <td>Buenos Aires (Argentine)</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Guy Perrier</td>\n","      <td>1925</td>\n","      <td>Chepniers (Charente-Maritime)</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Marie-Madeleine Machet</td>\n","      <td>1910</td>\n","      <td>Bordeaux</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Gilberte Émile-Mâle</td>\n","      <td>1912</td>\n","      <td>Paris</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Philippe Goujard</td>\n","      <td>1946</td>\n","      <td>Rouen (Seine-Maritime)</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>André Hastoy</td>\n","      <td>1920</td>\n","      <td>Paris (France)</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Jeanne Hives</td>\n","      <td>1927</td>\n","      <td>Villeneuve-sur-Lot (Lot-et-Garonne)</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Michel Grelon</td>\n","      <td>1945</td>\n","      <td>Angoulême (Chrente)</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Odette Elina</td>\n","      <td>1910</td>\n","      <td>Paris</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>André Frère</td>\n","      <td>1908</td>\n","      <td>Anvers, Belgique</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Sylvain Gagnière</td>\n","      <td>1905</td>\n","      <td>Avignon (Vaucluse)</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Henriette Jelinek</td>\n","      <td>1923</td>\n","      <td>Saint-Paul-les-Dax (Landes)</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Madeleine Giteau</td>\n","      <td>1918</td>\n","      <td>Nantes (Loire-Atlantique)</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Martial Chaulanges</td>\n","      <td>1903</td>\n","      <td>Ladignac (Haute-Vienne)</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Jacques Caizergues</td>\n","      <td>1918</td>\n","      <td>Talmont (Vendée)</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Philippe Canton</td>\n","      <td>1935</td>\n","      <td>Granges-sur-Vologne (Vosges)</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Robert Degos</td>\n","      <td>1904</td>\n","      <td>Mugron (Landes)</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Georges Demathieu</td>\n","      <td>1920</td>\n","      <td>Bourg-la-Reine (Hauts-de-Seine)</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Jean-Pierre Desthuilliers</td>\n","      <td>1939</td>\n","      <td>Versailles (Yvelines)</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Alexandre Doroszlai</td>\n","      <td>1930</td>\n","      <td>Budapest, Hongrie</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                          nom naissance                                 lieu\n","0                 Nardo Zalko      1941             Buenos Aires (Argentine)\n","1                 Guy Perrier      1925        Chepniers (Charente-Maritime)\n","2      Marie-Madeleine Machet      1910                             Bordeaux\n","3         Gilberte Émile-Mâle      1912                                Paris\n","4            Philippe Goujard      1946               Rouen (Seine-Maritime)\n","5                André Hastoy      1920                       Paris (France)\n","6                Jeanne Hives      1927  Villeneuve-sur-Lot (Lot-et-Garonne)\n","7               Michel Grelon      1945                  Angoulême (Chrente)\n","8                Odette Elina      1910                                Paris\n","9                 André Frère      1908                     Anvers, Belgique\n","10           Sylvain Gagnière      1905                   Avignon (Vaucluse)\n","11          Henriette Jelinek      1923          Saint-Paul-les-Dax (Landes)\n","12           Madeleine Giteau      1918            Nantes (Loire-Atlantique)\n","13         Martial Chaulanges      1903              Ladignac (Haute-Vienne)\n","14         Jacques Caizergues      1918                     Talmont (Vendée)\n","15            Philippe Canton      1935         Granges-sur-Vologne (Vosges)\n","16               Robert Degos      1904                      Mugron (Landes)\n","17          Georges Demathieu      1920      Bourg-la-Reine (Hauts-de-Seine)\n","18  Jean-Pierre Desthuilliers      1939                Versailles (Yvelines)\n","19        Alexandre Doroszlai      1930                    Budapest, Hongrie"]},"execution_count":9,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom  ?naissance ?lieu\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom \n","?auteur foaf:name ?nom .\n","\n","# un auteur a une année et un lieu de naissance\n","?auteur bio:birth ?naissance.\n","?auteur voc2:placeOfBirth ?lieu\n","\n","# on sélectionne les années de naissance dans l'intervalle [1900, 2000]\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer \n","     && xsd:integer (?naissance) < '2000'^^xsd:integer )\n","}\n","#ORDER BY ?nom\n","LIMIT 20\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"5rDrC98fmkw1"},"source":["### BNF A2 : les auteurs de la BNF référencés dans dbpedia\n","\n","Les auteurs ayant un identifiant externe pointant vers dbpedia\n"]},{"cell_type":"code","execution_count":10,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":6056,"status":"ok","timestamp":1682059001162,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"qDfx7tAqzUqp","outputId":"ad2b778a-f81c-42f7-a921-5746118580ac"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['nom', 'naissance', 'auteurDbpedia']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Isabelle Périer</td>\n","      <td>1978</td>\n","      <td>http://fr.dbpedia.org/resource/Isabelle_P%C3%A9rier</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Nathanaël Dupré La Tour</td>\n","      <td>1977</td>\n","      <td>http://fr.dbpedia.org/resource/Nathana%C3%ABl_Dupr%C3%A9_La_Tour</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Coralie Delaume</td>\n","      <td>1976</td>\n","      <td>http://fr.dbpedia.org/resource/Coralie_Delaume</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Claire Guézengar</td>\n","      <td>1972</td>\n","      <td>http://fr.dbpedia.org/resource/Claire_Guezengar</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Philippe Nassif</td>\n","      <td>1971</td>\n","      <td>http://fr.dbpedia.org/resource/Philippe_Nassif</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Benoït Violier</td>\n","      <td>1971</td>\n","      <td>http://fr.dbpedia.org/resource/Beno%C3%AEt_Violier</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Pierre Cherruau</td>\n","      <td>1969</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Cherruau</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Emmanuelle Marie</td>\n","      <td>1965</td>\n","      <td>http://fr.dbpedia.org/resource/Emmanuelle_Marie</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Thierry Wanegffelen</td>\n","      <td>1965</td>\n","      <td>http://fr.dbpedia.org/resource/Thierry_Wanegffelen</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                       nom naissance  \\\n","0              Axl Cendres      1982   \n","1          Isabelle Périer      1978   \n","2  Nathanaël Dupré La Tour      1977   \n","3          Coralie Delaume      1976   \n","4         Claire Guézengar      1972   \n","5          Philippe Nassif      1971   \n","6           Benoït Violier      1971   \n","7          Pierre Cherruau      1969   \n","8         Emmanuelle Marie      1965   \n","9      Thierry Wanegffelen      1965   \n","\n","                                                      auteurDbpedia  \n","0                        http://fr.dbpedia.org/resource/Axl_Cendres  \n","1               http://fr.dbpedia.org/resource/Isabelle_P%C3%A9rier  \n","2  http://fr.dbpedia.org/resource/Nathana%C3%ABl_Dupr%C3%A9_La_Tour  \n","3                    http://fr.dbpedia.org/resource/Coralie_Delaume  \n","4                   http://fr.dbpedia.org/resource/Claire_Guezengar  \n","5                    http://fr.dbpedia.org/resource/Philippe_Nassif  \n","6                http://fr.dbpedia.org/resource/Beno%C3%AEt_Violier  \n","7                    http://fr.dbpedia.org/resource/Pierre_Cherruau  \n","8                   http://fr.dbpedia.org/resource/Emmanuelle_Marie  \n","9                http://fr.dbpedia.org/resource/Thierry_Wanegffelen  "]},"execution_count":10,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom  ?naissance ?auteurDbpedia\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom, et une année de naissance\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","\n","# l'auteur existe également dans une source externe,\n","# on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","?auteur owl:sameAs ?auteurDbpedia .\n","\n","# naissance dans l'intervalle [1900, 2000] et la référence externe \"pointe\" vers dbpedia\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer \n","     && xsd:integer (?naissance) < '2000'^^xsd:integer \n","     && regex(?auteurDbpedia, \"http://fr.dbpedia.org\") \n","     )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 10\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"SdArE9Sd8TpF"},"source":["### BNF A3 : Les auteurs d'une oeuvre philosophique\n","\n","Voir T1 pour la liste des thèmes possibles autres que la philosophie.\n","\n","On se limite aux oeuvres écrite en français et sont l'auteur est référencé dans dbpedia france.\n"]},{"cell_type":"code","execution_count":11,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":241},"executionInfo":{"elapsed":1744,"status":"ok","timestamp":1682059002902,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"8yqeCT3F8cO-","outputId":"7a84b694-ac79-45e9-806f-306d57907016"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 éléments\n","schéma:  ['nom', 'auteurDbpedia']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Alexis Carrel</td>\n","      <td>http://fr.dbpedia.org/resource/Alexis_Carrel</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Antoine de Rivarol</td>\n","      <td>http://fr.dbpedia.org/resource/Antoine_de_Rivarol</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Bernard-Henri Lévy</td>\n","      <td>http://fr.dbpedia.org/resource/Bernard-Henri_L%C3%A9vy</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Bernard de Fontenelle</td>\n","      <td>http://fr.dbpedia.org/resource/Bernard_Le_Bouyer_de_Fontenelle</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Claude Guillon</td>\n","      <td>http://fr.dbpedia.org/resource/Claude_Guillon_%28%C3%A9crivain%29</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                     nom  \\\n","0          Alexis Carrel   \n","1     Antoine de Rivarol   \n","2     Bernard-Henri Lévy   \n","3  Bernard de Fontenelle   \n","4         Claude Guillon   \n","\n","                                                       auteurDbpedia  \n","0                       http://fr.dbpedia.org/resource/Alexis_Carrel  \n","1                  http://fr.dbpedia.org/resource/Antoine_de_Rivarol  \n","2             http://fr.dbpedia.org/resource/Bernard-Henri_L%C3%A9vy  \n","3     http://fr.dbpedia.org/resource/Bernard_Le_Bouyer_de_Fontenelle  \n","4  http://fr.dbpedia.org/resource/Claude_Guillon_%28%C3%A9crivain%29  "]},"execution_count":11,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom ?auteurDbpedia \n","WHERE { \n","  \n","  ?livre dc:creator ?auteur .\n","\n","  # un livre est un ouvrage textuel\n","  #?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","\n","  # le livre existe également dans une autre source\n","  ?livre owl:sameAs ?livreWiki .\n","\n","  # livre écrit en français\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le livre a pour theme \"Philosophie\"\n","  ?livre bnf:subject \"Philosophie\" .\n","\n","  # le nom de l'auteur\n","  ?auteur foaf:name ?nom .\n","\n","  # l'auteur existe également dans une autre source\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  FILTER ( regex(?livreWiki, \"http://wikidata.org\") \n","       &&  regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","  )\n","}\n","ORDER BY ?auteurDbpedia\n","\n","LIMIT 20\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats, 5)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"YKeWGRI4HPPu"},"source":["### BNF L1 : Les livres avec leurs auteurs\n","\n","Les livres écrit en français au 21eme siècle, référencés dans wikidata et dont l'auteur est référencé dans dbpedia\n"]},{"cell_type":"code","execution_count":12,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":84},"executionInfo":{"elapsed":859,"status":"ok","timestamp":1682059003755,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"EOf7x6RIGvRP","outputId":"6aca3336-f186-46df-f60b-c0722d8a87bf"},"outputs":[{"name":"stdout","output_type":"stream","text":["0 éléments\n","schéma:  []\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["Empty DataFrame\n","Columns: []\n","Index: []"]},"execution_count":12,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?annee ?nom ?titre ?auteurDbpedia\n","WHERE { \n","  \n","  ?livre dc:creator ?auteur .\n","\n","  # l'année de parution du livre\n","  ?livre dc:date ?annee .\n","\n","  # le titre du livre\n","  ?livre dc:title ?titre .\n","\n","  # un livre est un ouvrage textuel\n","  ?livre rda:P10004 <http://data.bnf.fr/vocabulary/work-form/te> .\n","\n","  # le livre existe également dans une autre source\n","  ?livre owl:sameAs ?livreWiki .\n","\n","  # livre écrit en français\n","  ?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","  # le nom de l'auteur\n","  ?auteur foaf:name ?nom.\n","\n","  # l'auteur existe également dans une autre source\n","  ?auteur owl:sameAs ?auteurDbpedia .\n","\n","  FILTER (\n","       xsd:integer (?annee) > '2000'^^xsd:integer \n","    && xsd:integer (?annee) < '2099'^^xsd:integer \n","    && regex(?livreWiki, \"http://wikidata.org\") \n","    &&  regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","  )\n","}\n","#ORDER BY desc(?annee)\n","\n","LIMIT 20\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","resultats = BNF.query().bindings\n","afficherResultat(resultats)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"f8MHZR2v9nWL"},"source":["## Source 2 : DBPedia France\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"lUV0Hse4IqBD"},"source":["### D1 : Informations sur une personne dont le nom contient certains mots.\n","\n","Afficher le nom, nationalité, profession, date et lieu de naissance\n"]},{"cell_type":"code","execution_count":13,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":739},"executionInfo":{"elapsed":2983,"status":"ok","timestamp":1682059006732,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"kE7pEqETIl00","outputId":"0dc3e7a3-b871-4e65-edb0-2c5b349ba3fa"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['p', 'name', 'nationalité', 'profession', 'naissance', 'lieu']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>name</th>\n","      <th>nationalité</th>\n","      <th>profession</th>\n","      <th>naissance</th>\n","      <th>lieu</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho</td>\n","      <td>Victor Hugo de Azevedo Coutinho</td>\n","      <td>http://fr.dbpedia.org/resource/Portugal</td>\n","      <td>http://fr.dbpedia.org/resource/Officier</td>\n","      <td>1871</td>\n","      <td>http://fr.dbpedia.org/resource/Macao</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_Green</td>\n","      <td>Victor Hugo Green</td>\n","      <td>Américain</td>\n","      <td></td>\n","      <td>1892</td>\n","      <td>http://fr.dbpedia.org/resource/New_York</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>http://fr.dbpedia.org/resource/Victor_Hugo_Green</td>\n","      <td>Victor Hugo Green</td>\n","      <td>Américain</td>\n","      <td></td>\n","      <td>1892</td>\n","      <td>http://fr.dbpedia.org/resource/États-Unis</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                                                p  \\\n","0  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","1  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","2  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","3  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","4  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","5  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","6  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","7  http://fr.dbpedia.org/resource/Victor_Hugo_de_Azevedo_Coutinho   \n","8                http://fr.dbpedia.org/resource/Victor_Hugo_Green   \n","9                http://fr.dbpedia.org/resource/Victor_Hugo_Green   \n","\n","                              name                              nationalité  \\\n","0  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","1                                   http://fr.dbpedia.org/resource/Portugal   \n","2                                   http://fr.dbpedia.org/resource/Portugal   \n","3                                   http://fr.dbpedia.org/resource/Portugal   \n","4  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","5  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","6                                   http://fr.dbpedia.org/resource/Portugal   \n","7  Victor Hugo de Azevedo Coutinho  http://fr.dbpedia.org/resource/Portugal   \n","8                Victor Hugo Green                                Américain   \n","9                Victor Hugo Green                                Américain   \n","\n","                                profession naissance  \\\n","0  http://fr.dbpedia.org/resource/Officier      1871   \n","1  http://fr.dbpedia.org/resource/Officier      1871   \n","2  http://fr.dbpedia.org/resource/Officier      1871   \n","3  http://fr.dbpedia.org/resource/Officier      1871   \n","4  http://fr.dbpedia.org/resource/Officier      1871   \n","5  http://fr.dbpedia.org/resource/Officier      1871   \n","6  http://fr.dbpedia.org/resource/Officier      1871   \n","7  http://fr.dbpedia.org/resource/Officier      1871   \n","8                                               1892   \n","9                                               1892   \n","\n","                                        lieu  \n","0       http://fr.dbpedia.org/resource/Macao  \n","1       http://fr.dbpedia.org/resource/Macao  \n","2       http://fr.dbpedia.org/resource/Macao  \n","3       http://fr.dbpedia.org/resource/Macao  \n","4       http://fr.dbpedia.org/resource/Macao  \n","5       http://fr.dbpedia.org/resource/Macao  \n","6       http://fr.dbpedia.org/resource/Macao  \n","7       http://fr.dbpedia.org/resource/Macao  \n","8    http://fr.dbpedia.org/resource/New_York  \n","9  http://fr.dbpedia.org/resource/États-Unis  "]},"execution_count":13,"metadata":{},"output_type":"execute_result"}],"source":["# l'expression régulière du nom à retrouver\n","MOTIF = \"Victor.*Hug\"\n","\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT ?p ?name ?nationalité ?profession year(xsd:dateTime(?naissance)) as ?naissance  ?lieu\n","  WHERE { \n","    ?p a dbo:Person .\n","    ?p foaf:name ?name .\n","    ?p dbo:birthDate ?naissance\n","    optional {?p dbp:nationalité ?nationalité}\n","    optional {?p dbp:profession ?profession}\n","    optional {?p dbp:lieuDeNaissance ?lieu}\n","\n","  FILTER (regex(?p, \"{MOTIF}\", \"i\") )\n","  }\n","  LIMIT 10\n","\"\"\"\n",")\n","\n","requete = requete_parametree.replace(\"{MOTIF}\", MOTIF)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"RmrC3XpMuVis"},"source":["### D2 : les infos détaillées sur une certaine personne\n"]},{"cell_type":"code","execution_count":14,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":289},"executionInfo":{"elapsed":20,"status":"ok","timestamp":1682059006732,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"aQyPyuSmuavU","outputId":"e71e4312-55c7-4bb2-b9e9-cb85e4eee168"},"outputs":[{"name":"stdout","output_type":"stream","text":["l'identifiant complet de la personne recherchée est : <http://fr.dbpedia.org/resource/Simone_de_Beauvoir>\n","6 éléments\n","schéma:  ['name', 'interet', 'idee']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>interet</th>\n","      <th>idee</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Philosophie</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Politique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Éthique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Philosophie</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Politique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Éthique</td>\n","      <td>Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                 name                                     interet  \\\n","0  Simone de Beauvoir  http://fr.dbpedia.org/resource/Philosophie   \n","1  Simone de Beauvoir    http://fr.dbpedia.org/resource/Politique   \n","2  Simone de Beauvoir      http://fr.dbpedia.org/resource/Éthique   \n","3                      http://fr.dbpedia.org/resource/Philosophie   \n","4                        http://fr.dbpedia.org/resource/Politique   \n","5                          http://fr.dbpedia.org/resource/Éthique   \n","\n","                                                                        idee  \n","0  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","1  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","2  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","3  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","4  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  \n","5  Éthiques du féminisme, féminisme existentialiste, éthiques de l'ambigüité  "]},"execution_count":14,"metadata":{},"output_type":"execute_result"}],"source":["# On fixe une certaine personne\n","PERSONNE = \"http://fr.dbpedia.org/resource/Simone_de_Beauvoir\"\n","# PERSONNE = 'http://fr.dbpedia.org/resource/Jean-Paul_Sartre'\n","\n","# substituer une variable par sa valeur dans une chaine de caractères\n","# id = f\"<{PERSONNE}>\"\n","id = \"<{PERSONNE}>\".replace(\"{PERSONNE}\", PERSONNE)\n","print(\"l'identifiant complet de la personne recherchée est :\", id)\n","\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT distinct ?name ?nationalite ?interet ?idee\n","  WHERE { \n","    ?pers foaf:name ?name \n","    optional {?pers dbp:nationalité ?nationalite}\n","    optional {?pers dbo:mainInterest ?interet}\n","    optional {?pers dbp:idéesRemarquables ?idee}\n","\n","#      optional {?pers  dbp:œuvresPrincipales ?oeuvre}\n","#      optional {?pers  dbo:influencedBy ?influenceur}\n","\n","    FILTER ( ?pers = <{PERSONNE}> ) \n","  }\n","  order by ?p\n","  LIMIT 20\n","\"\"\"\n",")\n","\n","# fixer le nom de la personne dans la requête\n","requete = requete_parametree.replace(\"{PERSONNE}\", PERSONNE)\n","\n","# print(\"la requête est :\", requete)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"FV5k4Bnd1QMV"},"source":["### D3 : la liste des oeuvres principales d'une personne donnée\n"]},{"cell_type":"code","execution_count":15,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":18,"status":"ok","timestamp":1682059006733,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"vGoCcvdp1bsz","outputId":"703fb5da-ed1d-4380-a6b9-faee9d089dda"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['name', 'oeuvre']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>oeuvre</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>L'Invitée</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>La Force de l'âge</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Le Deuxième Sexe</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Les Mandarins</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>Mémoires d'une jeune fille rangée</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td></td>\n","      <td>L'Invitée</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td></td>\n","      <td>La Force de l'âge</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td></td>\n","      <td>Le Deuxième Sexe</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td></td>\n","      <td>Les Mandarins</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td></td>\n","      <td>Mémoires d'une jeune fille rangée</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                 name                             oeuvre\n","0  Simone de Beauvoir                          L'Invitée\n","1  Simone de Beauvoir                  La Force de l'âge\n","2  Simone de Beauvoir                   Le Deuxième Sexe\n","3  Simone de Beauvoir                      Les Mandarins\n","4  Simone de Beauvoir  Mémoires d'une jeune fille rangée\n","5                                              L'Invitée\n","6                                      La Force de l'âge\n","7                                       Le Deuxième Sexe\n","8                                          Les Mandarins\n","9                      Mémoires d'une jeune fille rangée"]},"execution_count":15,"metadata":{},"output_type":"execute_result"}],"source":["# On fixe une certaine personne\n","PERSONNE = \"http://fr.dbpedia.org/resource/Simone_de_Beauvoir\"\n","\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","    SELECT distinct ?name ?oeuvre\n","    WHERE { \n","      ?pers foaf:name ?name \n","      optional {?pers  dbp:œuvresPrincipales ?oeuvre}\n","#     optional {?pers  dbo:influencedBy ?influenceur}\n","\n","    FILTER ( ?pers = <{PERSONNE}> ) \n","}\n","order by ?p\n","LIMIT 20\n","\"\"\"\n",")\n","# fixer le nom de la personne dans la requête\n","requete = requete_parametree.replace(\"{PERSONNE}\", PERSONNE)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"ZFLgbjEf4MX6"},"source":["### D4 : les influenceurs d'une personne donnée\n"]},{"cell_type":"code","execution_count":16,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":728},"executionInfo":{"elapsed":340,"status":"ok","timestamp":1682059007057,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"MjtM2m484RvJ","outputId":"fa4b1341-9147-4470-dd22-3f3d6c7d2b91"},"outputs":[{"name":"stdout","output_type":"stream","text":["20 resultats\n","20 éléments\n","schéma:  ['name', 'influenceur']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>influenceur</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Alfred_Adler</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Edmund_Husserl</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Emmanuel_Kant</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Engels</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Nietzsche</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Jean-Paul_Sartre</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Karl_Marx</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/René_Descartes</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Søren_Kierkegaard</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Martin_Heidegger</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Simone de Beauvoir</td>\n","      <td>http://fr.dbpedia.org/resource/Mary_Wollstonecraft</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Alfred_Adler</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Edmund_Husserl</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Emmanuel_Kant</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Engels</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Friedrich_Nietzsche</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                  name  \\\n","0   Simone de Beauvoir   \n","1   Simone de Beauvoir   \n","2   Simone de Beauvoir   \n","3   Simone de Beauvoir   \n","4   Simone de Beauvoir   \n","5   Simone de Beauvoir   \n","6   Simone de Beauvoir   \n","7   Simone de Beauvoir   \n","8   Simone de Beauvoir   \n","9   Simone de Beauvoir   \n","10  Simone de Beauvoir   \n","11  Simone de Beauvoir   \n","12  Simone de Beauvoir   \n","13                       \n","14                       \n","15                       \n","16                       \n","17                       \n","18                       \n","19                       \n","\n","                                                     influenceur  \n","0                    http://fr.dbpedia.org/resource/Alfred_Adler  \n","1                  http://fr.dbpedia.org/resource/Edmund_Husserl  \n","2                   http://fr.dbpedia.org/resource/Emmanuel_Kant  \n","3   http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre  \n","4                http://fr.dbpedia.org/resource/Friedrich_Engels  \n","5             http://fr.dbpedia.org/resource/Friedrich_Nietzsche  \n","6   http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel  \n","7                http://fr.dbpedia.org/resource/Jean-Paul_Sartre  \n","8                       http://fr.dbpedia.org/resource/Karl_Marx  \n","9                  http://fr.dbpedia.org/resource/René_Descartes  \n","10              http://fr.dbpedia.org/resource/Søren_Kierkegaard  \n","11               http://fr.dbpedia.org/resource/Martin_Heidegger  \n","12            http://fr.dbpedia.org/resource/Mary_Wollstonecraft  \n","13                   http://fr.dbpedia.org/resource/Alfred_Adler  \n","14                 http://fr.dbpedia.org/resource/Edmund_Husserl  \n","15                  http://fr.dbpedia.org/resource/Emmanuel_Kant  \n","16  http://fr.dbpedia.org/resource/François_Poullain_de_La_Barre  \n","17               http://fr.dbpedia.org/resource/Friedrich_Engels  \n","18            http://fr.dbpedia.org/resource/Friedrich_Nietzsche  \n","19  http://fr.dbpedia.org/resource/Georg_Wilhelm_Friedrich_Hegel  "]},"execution_count":16,"metadata":{},"output_type":"execute_result"}],"source":["# On fixe une certaine personne\n","PERSONNE = \"http://fr.dbpedia.org/resource/Simone_de_Beauvoir\"\n","# PERSONNE = 'http://fr.dbpedia.org/resource/Judith_Butler'\n","\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","   SELECT distinct ?name ?influenceur\n","    WHERE { \n","      ?pers foaf:name ?name \n","      optional {?pers  dbo:influencedBy ?influenceur}\n","\n","    FILTER ( ?pers = <{PERSONNE}> ) \n","}\n","order by ?p\n","LIMIT 20\n","\"\"\"\n",")\n","\n","# fixer le nom de la personne dans la requête\n","requete = requete_parametree.replace(\"{PERSONNE}\", PERSONNE)\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","print(len(res), \"resultats\")\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"LqQ8D31uS1Zv"},"source":["### D5 : Les auteurs nés en 1950\n","\n","Utiliser la fonction year pour extraire l'année de naissance à partir d'une date de naissance.\n"]},{"cell_type":"code","execution_count":17,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":397},"executionInfo":{"elapsed":1074,"status":"ok","timestamp":1682060751653,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"woS_g1UbTFQy","outputId":"33a14187-f08b-4da2-e180-a2a873ac1007"},"outputs":[{"name":"stdout","output_type":"stream","text":["10 éléments\n","schéma:  ['p', 'name', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>name</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Abdallah_Kaâbi</td>\n","      <td></td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Abdallah_Kaâbi</td>\n","      <td>Abdallah Kaâbi</td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/Abdallah_Kaâbi</td>\n","      <td></td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Abdallah_Kaâbi</td>\n","      <td>Abdallah Kaâbi</td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed</td>\n","      <td></td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed</td>\n","      <td>Abdelatif Baba Ahmed</td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed</td>\n","      <td></td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed</td>\n","      <td>Abdelatif Baba Ahmed</td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>http://fr.dbpedia.org/resource/Abdeslam_Seddiki</td>\n","      <td></td>\n","      <td>1951</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>http://fr.dbpedia.org/resource/Abdeslam_Seddiki</td>\n","      <td>Abdeslam Seddiki</td>\n","      <td>1951</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                                                     p                  name  \\\n","0        http://fr.dbpedia.org/resource/Abdallah_Kaâbi                         \n","1        http://fr.dbpedia.org/resource/Abdallah_Kaâbi        Abdallah Kaâbi   \n","2        http://fr.dbpedia.org/resource/Abdallah_Kaâbi                         \n","3        http://fr.dbpedia.org/resource/Abdallah_Kaâbi        Abdallah Kaâbi   \n","4  http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed                         \n","5  http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed  Abdelatif Baba Ahmed   \n","6  http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed                         \n","7  http://fr.dbpedia.org/resource/Abdelatif_Baba_Ahmed  Abdelatif Baba Ahmed   \n","8      http://fr.dbpedia.org/resource/Abdeslam_Seddiki                         \n","9      http://fr.dbpedia.org/resource/Abdeslam_Seddiki      Abdeslam Seddiki   \n","\n","  naissance  \n","0      1951  \n","1      1951  \n","2      1951  \n","3      1951  \n","4      1951  \n","5      1951  \n","6      1951  \n","7      1951  \n","8      1951  \n","9      1951  "]},"execution_count":17,"metadata":{},"output_type":"execute_result"}],"source":["# On fixe une certaine année\n","ANNEE = 1951\n","\n","requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","    SELECT ?p ?name year(xsd:dateTime(?naissance)) as ?naissance\n","    WHERE { \n","      ?p a dbo:Person .\n","      ?p foaf:name ?name .\n","      ?p dbo:birthDate ?naissance\n","      FILTER( regex(?naissance, \"{ANNEE}\"))\n","    }\n","order by ?p\n","LIMIT 10\n","\"\"\"\n",")\n","\n","requete = requete_parametree.replace(\"{ANNEE}\", str(ANNEE))\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"C0jnq8MeA25v"},"source":["### D6 : La liste de tous les intérets principaux\n"]},{"cell_type":"code","execution_count":18,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":1000},"executionInfo":{"elapsed":1824,"status":"ok","timestamp":1682059008877,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"uy5m_PAuBCgF","outputId":"efd09096-593a-4130-c3bd-a0f2858466cd"},"outputs":[{"name":"stdout","output_type":"stream","text":["50 éléments\n","schéma:  ['interet']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>interet</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Activisme politique</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Afrique</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Agnosticisme</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Alchimie</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Amour</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Amour platonique</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Angélologie</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Anthropologie</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Anthropologie linguistique</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Anthropologie philosophique</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Antilles</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Apocatastase</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Archéologie</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Archétype (psychologie analytique)</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Aristote</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Aristotélisme</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Arithmétique</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Art</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Arts libéraux</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Ascèse</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>Astrologie</td>\n","    </tr>\n","    <tr>\n","      <th>21</th>\n","      <td>Astronomie</td>\n","    </tr>\n","    <tr>\n","      <th>22</th>\n","      <td>Astronomie arabe</td>\n","    </tr>\n","    <tr>\n","      <th>23</th>\n","      <td>Attitude propositionnelle</td>\n","    </tr>\n","    <tr>\n","      <th>24</th>\n","      <td>Averroès</td>\n","    </tr>\n","    <tr>\n","      <th>25</th>\n","      <td>Bande dessinée</td>\n","    </tr>\n","    <tr>\n","      <th>26</th>\n","      <td>Baruch Spinoza</td>\n","    </tr>\n","    <tr>\n","      <th>27</th>\n","      <td>Bassari (peuple)</td>\n","    </tr>\n","    <tr>\n","      <th>28</th>\n","      <td>Bertolt Brecht</td>\n","    </tr>\n","    <tr>\n","      <th>29</th>\n","      <td>Bible</td>\n","    </tr>\n","    <tr>\n","      <th>30</th>\n","      <td>Bibliothéconomie</td>\n","    </tr>\n","    <tr>\n","      <th>31</th>\n","      <td>Bien-être animal</td>\n","    </tr>\n","    <tr>\n","      <th>32</th>\n","      <td>Biologie</td>\n","    </tr>\n","    <tr>\n","      <th>33</th>\n","      <td>Bioéthique</td>\n","    </tr>\n","    <tr>\n","      <th>34</th>\n","      <td>Botanique</td>\n","    </tr>\n","    <tr>\n","      <th>35</th>\n","      <td>Bouddhisme</td>\n","    </tr>\n","    <tr>\n","      <th>36</th>\n","      <td>Bouddhisme au Japon</td>\n","    </tr>\n","    <tr>\n","      <th>37</th>\n","      <td>Brochage</td>\n","    </tr>\n","    <tr>\n","      <th>38</th>\n","      <td>Byzance</td>\n","    </tr>\n","    <tr>\n","      <th>39</th>\n","      <td>Capitalisme</td>\n","    </tr>\n","    <tr>\n","      <th>40</th>\n","      <td>Chamanisme</td>\n","    </tr>\n","    <tr>\n","      <th>41</th>\n","      <td>Charia</td>\n","    </tr>\n","    <tr>\n","      <th>42</th>\n","      <td>Chimie</td>\n","    </tr>\n","    <tr>\n","      <th>43</th>\n","      <td>Christianisme</td>\n","    </tr>\n","    <tr>\n","      <th>44</th>\n","      <td>Cinéma</td>\n","    </tr>\n","    <tr>\n","      <th>45</th>\n","      <td>Cognition</td>\n","    </tr>\n","    <tr>\n","      <th>46</th>\n","      <td>Communication</td>\n","    </tr>\n","    <tr>\n","      <th>47</th>\n","      <td>Coniaguis</td>\n","    </tr>\n","    <tr>\n","      <th>48</th>\n","      <td>Connaissance</td>\n","    </tr>\n","    <tr>\n","      <th>49</th>\n","      <td>Conscience</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                               interet\n","0                  Activisme politique\n","1                              Afrique\n","2                         Agnosticisme\n","3                             Alchimie\n","4                                Amour\n","5                     Amour platonique\n","6                          Angélologie\n","7                        Anthropologie\n","8           Anthropologie linguistique\n","9          Anthropologie philosophique\n","10                            Antilles\n","11                        Apocatastase\n","12                         Archéologie\n","13  Archétype (psychologie analytique)\n","14                            Aristote\n","15                       Aristotélisme\n","16                        Arithmétique\n","17                                 Art\n","18                       Arts libéraux\n","19                              Ascèse\n","20                          Astrologie\n","21                          Astronomie\n","22                    Astronomie arabe\n","23           Attitude propositionnelle\n","24                            Averroès\n","25                      Bande dessinée\n","26                      Baruch Spinoza\n","27                    Bassari (peuple)\n","28                      Bertolt Brecht\n","29                               Bible\n","30                    Bibliothéconomie\n","31                    Bien-être animal\n","32                            Biologie\n","33                          Bioéthique\n","34                           Botanique\n","35                          Bouddhisme\n","36                 Bouddhisme au Japon\n","37                            Brochage\n","38                             Byzance\n","39                         Capitalisme\n","40                          Chamanisme\n","41                              Charia\n","42                              Chimie\n","43                       Christianisme\n","44                              Cinéma\n","45                           Cognition\n","46                       Communication\n","47                           Coniaguis\n","48                        Connaissance\n","49                          Conscience"]},"execution_count":18,"metadata":{},"output_type":"execute_result"}],"source":["requete = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","    SELECT distinct ?interet\n","    WHERE { \n","      ?personne dbo:mainInterest ?o .\n","      ?o rdfs:label ?interet .\n","\n","      FILTER (langMatches( lang(?interet), \"FR\" ) )\n","}\n","order by ?interet\n","LIMIT 50\n","\"\"\"\n",")\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"6gvLL5s4F4rD"},"source":["### D7 la liste des philosophes dans Dbpedia\n"]},{"cell_type":"code","execution_count":19,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":415},"executionInfo":{"elapsed":344,"status":"ok","timestamp":1682059009217,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"vwv5vauxGAf6","outputId":"5c320dce-aec9-425c-f030-c8aa17de4192"},"outputs":[{"name":"stdout","output_type":"stream","text":["durée 126 ms\n","10 éléments\n","schéma:  ['name', 'p']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>p</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Œuvre_de_Friedrich_Nietzsche</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abu_'Ali_Al-Jubbâ'i</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abu_al-Hudhayl</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Abū_Hāshīm_al-Jubbā'ī</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Adam_Smith</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Aimé_Forest</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Al-Fârâbî</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Al-Ghazali</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Alain_(philosophe)</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Alfred_Tarski</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["  name                                                            p\n","0       http://fr.dbpedia.org/resource/Œuvre_de_Friedrich_Nietzsche\n","1                http://fr.dbpedia.org/resource/Abu_'Ali_Al-Jubbâ'i\n","2                     http://fr.dbpedia.org/resource/Abu_al-Hudhayl\n","3              http://fr.dbpedia.org/resource/Abū_Hāshīm_al-Jubbā'ī\n","4                         http://fr.dbpedia.org/resource/Adam_Smith\n","5                        http://fr.dbpedia.org/resource/Aimé_Forest\n","6                          http://fr.dbpedia.org/resource/Al-Fârâbî\n","7                         http://fr.dbpedia.org/resource/Al-Ghazali\n","8                 http://fr.dbpedia.org/resource/Alain_(philosophe)\n","9                      http://fr.dbpedia.org/resource/Alfred_Tarski"]},"execution_count":19,"metadata":{},"output_type":"execute_result"}],"source":["import time\n","\n","requete = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","    \n","SELECT distinct  ?name ?p\n","WHERE { \n","  ?p rdf:type dbo:Philosopher .\n","  ?p foaf:name ?name\n","}\n","order by ?name\n","limit 10\n","\"\"\"\n",")\n","\n","start_time = time.time()\n","\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","\n","duree = int((time.time() - start_time) * 1000)\n","print(f\"durée {duree} ms\")\n","\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"2RKTA5N6I3zj"},"source":["# Exercice 1 : Requêtes réparties entre les 2 sources BNF et DBPedia\n","\n","A compléter\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"Ls1_lNNv90fo"},"source":["### J1: Jointure A3 avec D2 par boucles imbriquées\n","\n","Proposer une solution pour calculer la jointure entre A3 sur le site BNF et D2 sur le site DBPedia.\n","Pour chaque livre de afficher son titre et son année, le nom de l'auteur, sa nationalité et la liste de ses idées remarquables.\n"]},{"cell_type":"code","execution_count":89,"metadata":{"executionInfo":{"elapsed":5,"status":"ok","timestamp":1682059009218,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"pv-dFhIxI50c"},"outputs":[],"source":["requete = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?livre ?nom ?naissance ?auteurDbpedia\n","WHERE {\n","\n","# une oeuvre est associée a (au moins) un auteur\n","?livre dc:creator ?auteur.\n","\n","# livre écrit en français\n","?livre dc:language <http://id.loc.gov/vocabulary/iso639-2/fre> .\n","\n","# un auteur a un nom, et une année de naissance\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","\n","# l'auteur existe également dans une source externe,\n","# on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","?auteur owl:sameAs ?auteurDbpedia .\n","\n","# naissance dans l'intervalle [1900, 2000] et la référence externe \"pointe\" vers dbpedia\n","FILTER (xsd:integer (?naissance) > '1900'^^xsd:integer \n","     && xsd:integer (?naissance) < '2000'^^xsd:integer \n","     && regex(?auteurDbpedia, \"http://fr.dbpedia.org\") \n","     )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 1000\n","\"\"\"\n",")\n","\n","BNF.setQuery(requete)\n","\n","res_A3 = BNF.query().bindings\n","df_A3 = pd.DataFrame(res_A3).applymap(lambda x: x.value)"]},{"cell_type":"code","execution_count":92,"metadata":{},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>livre</th>\n","      <th>nom</th>\n","      <th>naissance</th>\n","      <th>auteurDbpedia</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://data.bnf.fr/temp-work/cfaedd0417cc942f2cba0522e60de1df/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://data.bnf.fr/temp-work/e7e18631c382c2ac1cb4865cd348c753/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://data.bnf.fr/temp-work/d6f5ce4eebd69d292068ff9f4f674512/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://data.bnf.fr/temp-work/00ed4610432378cac7b1d33464e51352/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://data.bnf.fr/temp-work/dda86386c8a378808e05b81b53424a1a/#about</td>\n","      <td>Axl Cendres</td>\n","      <td>1982</td>\n","      <td>http://fr.dbpedia.org/resource/Axl_Cendres</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>6674</th>\n","      <td>http://data.bnf.fr/temp-work/7b3ac660e537b35e50c609685393b2b6/#about</td>\n","      <td>Pierre Morhange</td>\n","      <td>1901</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Morhange</td>\n","    </tr>\n","    <tr>\n","      <th>6675</th>\n","      <td>http://data.bnf.fr/temp-work/667cfc6838321294aad921e4ff1ee71f/#about</td>\n","      <td>Pierre Morhange</td>\n","      <td>1901</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Morhange</td>\n","    </tr>\n","    <tr>\n","      <th>6676</th>\n","      <td>http://data.bnf.fr/temp-work/06c80a0dd179e6c63ccab52c4e8d5294/#about</td>\n","      <td>Pierre Biquard</td>\n","      <td>1901</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Biquard</td>\n","    </tr>\n","    <tr>\n","      <th>6677</th>\n","      <td>http://data.bnf.fr/temp-work/4c7005074762ded79b1611eaee8e0f18/#about</td>\n","      <td>Pierre Biquard</td>\n","      <td>1901</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Biquard</td>\n","    </tr>\n","    <tr>\n","      <th>6678</th>\n","      <td>http://data.bnf.fr/temp-work/07f5f5b416ec8d95abb7ef71e0d61bc9/#about</td>\n","      <td>Pierre Biquard</td>\n","      <td>1901</td>\n","      <td>http://fr.dbpedia.org/resource/Pierre_Biquard</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>6679 rows × 4 columns</p>\n","</div>"],"text/plain":["                                                                     livre  \\\n","0     http://data.bnf.fr/temp-work/cfaedd0417cc942f2cba0522e60de1df/#about   \n","1     http://data.bnf.fr/temp-work/e7e18631c382c2ac1cb4865cd348c753/#about   \n","2     http://data.bnf.fr/temp-work/d6f5ce4eebd69d292068ff9f4f674512/#about   \n","3     http://data.bnf.fr/temp-work/00ed4610432378cac7b1d33464e51352/#about   \n","4     http://data.bnf.fr/temp-work/dda86386c8a378808e05b81b53424a1a/#about   \n","...                                                                    ...   \n","6674  http://data.bnf.fr/temp-work/7b3ac660e537b35e50c609685393b2b6/#about   \n","6675  http://data.bnf.fr/temp-work/667cfc6838321294aad921e4ff1ee71f/#about   \n","6676  http://data.bnf.fr/temp-work/06c80a0dd179e6c63ccab52c4e8d5294/#about   \n","6677  http://data.bnf.fr/temp-work/4c7005074762ded79b1611eaee8e0f18/#about   \n","6678  http://data.bnf.fr/temp-work/07f5f5b416ec8d95abb7ef71e0d61bc9/#about   \n","\n","                  nom naissance  \\\n","0         Axl Cendres      1982   \n","1         Axl Cendres      1982   \n","2         Axl Cendres      1982   \n","3         Axl Cendres      1982   \n","4         Axl Cendres      1982   \n","...               ...       ...   \n","6674  Pierre Morhange      1901   \n","6675  Pierre Morhange      1901   \n","6676   Pierre Biquard      1901   \n","6677   Pierre Biquard      1901   \n","6678   Pierre Biquard      1901   \n","\n","                                       auteurDbpedia  \n","0         http://fr.dbpedia.org/resource/Axl_Cendres  \n","1         http://fr.dbpedia.org/resource/Axl_Cendres  \n","2         http://fr.dbpedia.org/resource/Axl_Cendres  \n","3         http://fr.dbpedia.org/resource/Axl_Cendres  \n","4         http://fr.dbpedia.org/resource/Axl_Cendres  \n","...                                              ...  \n","6674  http://fr.dbpedia.org/resource/Pierre_Morhange  \n","6675  http://fr.dbpedia.org/resource/Pierre_Morhange  \n","6676   http://fr.dbpedia.org/resource/Pierre_Biquard  \n","6677   http://fr.dbpedia.org/resource/Pierre_Biquard  \n","6678   http://fr.dbpedia.org/resource/Pierre_Biquard  \n","\n","[6679 rows x 4 columns]"]},"execution_count":92,"metadata":{},"output_type":"execute_result"}],"source":["df_A3"]},{"cell_type":"code","execution_count":93,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["['http://fr.dbpedia.org/resource/Axl_Cendres'\n"," 'http://fr.dbpedia.org/resource/Isabelle_P%C3%A9rier'\n"," 'http://fr.dbpedia.org/resource/Nathana%C3%ABl_Dupr%C3%A9_La_Tour' ...\n"," 'http://fr.dbpedia.org/resource/Amadou_Hamp%C3%A2t%C3%A9_B%C3%A2'\n"," 'http://fr.dbpedia.org/resource/Pierre_Morhange'\n"," 'http://fr.dbpedia.org/resource/Pierre_Biquard']\n"]}],"source":["personnes = df_A3[\"auteurDbpedia\"].unique()\n","len(personnes)"]},{"cell_type":"code","execution_count":94,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["257 éléments\n","schéma:  ['name', 'nationalite']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>nationalite</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Philippe Nassif</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Thierry Aprile</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>95</th>\n","      <td>John Littleton</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>96</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>97</th>\n","      <td>Michel van Schendel</td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td></td>\n","      <td></td>\n","    </tr>\n","    <tr>\n","      <th>99</th>\n","      <td>Serge Hutin</td>\n","      <td></td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>100 rows × 2 columns</p>\n","</div>"],"text/plain":["                   name nationalite\n","0                                  \n","1       Philippe Nassif            \n","2                                  \n","3        Thierry Aprile            \n","4                                  \n","..                  ...         ...\n","95       John Littleton            \n","96                                 \n","97  Michel van Schendel            \n","98                                 \n","99          Serge Hutin            \n","\n","[100 rows x 2 columns]"]},"execution_count":94,"metadata":{},"output_type":"execute_result"}],"source":["requete_parametree = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT distinct ?name ?nationalite ?interet ?idee\n","  WHERE { \n","    ?pers foaf:name ?name \n","    optional {?pers dbp:nationalité ?nationalite}\n","    optional {?pers dbo:mainInterest ?interet}\n","    optional {?pers dbp:idéesRemarquables ?idee}\n","\n","#      optional {?pers  dbp:œuvresPrincipales ?oeuvre}\n","#      optional {?pers  dbo:influencedBy ?influenceur}\n","\n","   auteur FILTER ( ?pers = <{PERSONNE}> ) \n","  }\n","  order by ?p\n","  LIMIT 20\n","\"\"\"\n",")\n","\n","res = []\n","for personne in personnes:\n","    DBPEDIA.setQuery(requete_parametree.replace(\"{PERSONNE}\", personne))\n","    D2 = DBPEDIA.query().bindings\n","    res += D2\n","\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"BJm4deKz_UAv"},"source":["### J2 : Pour une année N afficher la liste des personnes qui sont nées l'année N et qui existent à la fois dans la BNF et dans DBPedia.\n","\n","Proposer une solution par fusion de deux résultats triés\n"]},{"cell_type":"code","execution_count":127,"metadata":{"executionInfo":{"elapsed":4,"status":"ok","timestamp":1682059009218,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"WUlkb4_-6-r_"},"outputs":[{"name":"stdout","output_type":"stream","text":["127 éléments\n","schéma:  ['nom', 'auteurDbpedia', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>André Baruc</td>\n","      <td>http://fr.dbpedia.org/resource/Andr%C3%A9_Baruc</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Paul van Stalle</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Van_Stalle</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Harold Rome</td>\n","      <td>http://fr.dbpedia.org/resource/Harold_Rome</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Jane Chacun</td>\n","      <td>http://fr.dbpedia.org/resource/Jane_Chacun</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Georg Hurdalek</td>\n","      <td>http://fr.dbpedia.org/resource/George_Hurdalek</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>95</th>\n","      <td>Nils Johan Rud</td>\n","      <td>http://fr.dbpedia.org/resource/Nils_Johan_Rud</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>96</th>\n","      <td>Germaine Lacaze</td>\n","      <td>http://fr.dbpedia.org/resource/Germaine_Lacaze</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>97</th>\n","      <td>Peter Charanis</td>\n","      <td>http://fr.dbpedia.org/resource/Peter_Charanis</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>Jeannie Robertson</td>\n","      <td>http://fr.dbpedia.org/resource/Jeannie_Robertson</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>99</th>\n","      <td>Quinto Martini</td>\n","      <td>http://fr.dbpedia.org/resource/Quinto_Martini_%28sculpteur_et_peintre%29</td>\n","      <td>1908</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>100 rows × 3 columns</p>\n","</div>"],"text/plain":["                  nom  \\\n","0         André Baruc   \n","1     Paul van Stalle   \n","2         Harold Rome   \n","3         Jane Chacun   \n","4      Georg Hurdalek   \n","..                ...   \n","95     Nils Johan Rud   \n","96    Germaine Lacaze   \n","97     Peter Charanis   \n","98  Jeannie Robertson   \n","99     Quinto Martini   \n","\n","                                                               auteurDbpedia  \\\n","0                            http://fr.dbpedia.org/resource/Andr%C3%A9_Baruc   \n","1                             http://fr.dbpedia.org/resource/Paul_Van_Stalle   \n","2                                 http://fr.dbpedia.org/resource/Harold_Rome   \n","3                                 http://fr.dbpedia.org/resource/Jane_Chacun   \n","4                             http://fr.dbpedia.org/resource/George_Hurdalek   \n","..                                                                       ...   \n","95                             http://fr.dbpedia.org/resource/Nils_Johan_Rud   \n","96                            http://fr.dbpedia.org/resource/Germaine_Lacaze   \n","97                             http://fr.dbpedia.org/resource/Peter_Charanis   \n","98                          http://fr.dbpedia.org/resource/Jeannie_Robertson   \n","99  http://fr.dbpedia.org/resource/Quinto_Martini_%28sculpteur_et_peintre%29   \n","\n","   naissance  \n","0       1908  \n","1       1908  \n","2       1908  \n","3       1908  \n","4       1908  \n","..       ...  \n","95      1908  \n","96      1908  \n","97      1908  \n","98      1908  \n","99      1908  \n","\n","[100 rows x 3 columns]"]},"execution_count":127,"metadata":{},"output_type":"execute_result"}],"source":["# A compléter\n","annee = 1908\n","\n","req1 = (\n","    BNF_prefix\n","    + \"\"\"\n","SELECT distinct ?nom ?auteurDbpedia ?naissance\n","WHERE {\n","# un auteur a un nom, et une année de naissance\n","?auteur foaf:name ?nom ; bio:birth ?naissance .\n","\n","# l'auteur existe également dans une source externe,\n","# on dit qu'il est \"aligné\" avec un autre instance du même individu.\n","?auteur owl:sameAs ?auteurDbpedia .\n","\n","# référence externe \"pointe\" vers dbpedia\n","FILTER (regex(?auteurDbpedia, \"http://fr.dbpedia.org\")\n","        && xsd:integer(?naissance) = '{ANNEE}'^^xsd:integer )\n","}\n","ORDER BY desc(?naissance)\n","LIMIT 1000\n","\"\"\"\n",")\n","\n","BNF.setQuery(req1.replace(\"{ANNEE}\", str(annee)))\n","res1 = BNF.query().bindings\n","df1 = pd.DataFrame(res1).applymap(lambda x: x.value)\n","\n","afficherResultat(res1)\n"]},{"cell_type":"code","execution_count":128,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["1291 éléments\n","schéma:  ['p', 'naissance']\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>p</th>\n","      <th>naissance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>http://fr.dbpedia.org/resource/Štefan_Čambal</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>http://fr.dbpedia.org/resource/Ștefan_Barbu</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>http://fr.dbpedia.org/resource/A.I._Bezzerides</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelhalim_Hemche</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>http://fr.dbpedia.org/resource/Abdelkader_Benazzedine</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>...</th>\n","      <td>...</td>\n","      <td>...</td>\n","    </tr>\n","    <tr>\n","      <th>95</th>\n","      <td>http://fr.dbpedia.org/resource/Antoine_Mazier</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>96</th>\n","      <td>http://fr.dbpedia.org/resource/Antonio_Canepa</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>97</th>\n","      <td>http://fr.dbpedia.org/resource/Antonio_Cánovas_del_Castillo_de_Rey</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>98</th>\n","      <td>http://fr.dbpedia.org/resource/Antonín_Bartoň</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>99</th>\n","      <td>http://fr.dbpedia.org/resource/António_Abrantes_Mendes</td>\n","      <td>1908</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>100 rows × 2 columns</p>\n","</div>"],"text/plain":["                                                                     p  \\\n","0                         http://fr.dbpedia.org/resource/Štefan_Čambal   \n","1                          http://fr.dbpedia.org/resource/Ștefan_Barbu   \n","2                       http://fr.dbpedia.org/resource/A.I._Bezzerides   \n","3                     http://fr.dbpedia.org/resource/Abdelhalim_Hemche   \n","4                http://fr.dbpedia.org/resource/Abdelkader_Benazzedine   \n","..                                                                 ...   \n","95                       http://fr.dbpedia.org/resource/Antoine_Mazier   \n","96                       http://fr.dbpedia.org/resource/Antonio_Canepa   \n","97  http://fr.dbpedia.org/resource/Antonio_Cánovas_del_Castillo_de_Rey   \n","98                       http://fr.dbpedia.org/resource/Antonín_Bartoň   \n","99              http://fr.dbpedia.org/resource/António_Abrantes_Mendes   \n","\n","   naissance  \n","0       1908  \n","1       1908  \n","2       1908  \n","3       1908  \n","4       1908  \n","..       ...  \n","95      1908  \n","96      1908  \n","97      1908  \n","98      1908  \n","99      1908  \n","\n","[100 rows x 2 columns]"]},"execution_count":128,"metadata":{},"output_type":"execute_result"}],"source":["\n","req2 = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","  SELECT distinct ?p year(xsd:dateTime(?naissance)) as ?naissance\n","  WHERE { \n","    ?p a dbo:Person .\n","    ?p dbo:birthDate ?naissance\n","    FILTER ( regex (?naissance, '{ANNEE}') )\n","  }\n","  ORDER BY desc(?naissance)\n","  LIMIT 10000\n","\"\"\"\n",")\n","\n","DBPEDIA.setQuery(req2.replace(\"{ANNEE}\", str(annee)))\n","res2 = DBPEDIA.query().bindings\n","df2 = pd.DataFrame(res2).applymap(lambda x: x.value)\n","\n","afficherResultat(res2)\n"]},{"cell_type":"code","execution_count":129,"metadata":{},"outputs":[{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>nom</th>\n","      <th>auteurDbpedia</th>\n","      <th>naissance_x</th>\n","      <th>p</th>\n","      <th>naissance_y</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Harold Rome</td>\n","      <td>http://fr.dbpedia.org/resource/Harold_Rome</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Harold_Rome</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Georg Hurdalek</td>\n","      <td>http://fr.dbpedia.org/resource/George_Hurdalek</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/George_Hurdalek</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Georgij Georgievič Demidov</td>\n","      <td>http://fr.dbpedia.org/resource/Gueorgui_Demidov</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Gueorgui_Demidov</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Richard Wormser</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Wormser</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Wormser</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Yvette Cauchois</td>\n","      <td>http://fr.dbpedia.org/resource/Yvette_Cauchois</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Yvette_Cauchois</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Vicente Asencio</td>\n","      <td>http://fr.dbpedia.org/resource/Vicente_Asencio</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Vicente_Asencio</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td>Robert Cummings</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Cummings</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Cummings</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Jean Jeanneteau</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Jeanneteau</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Jean_Jeanneteau</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Isis Kischka</td>\n","      <td>http://fr.dbpedia.org/resource/Isis_Kischka</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Isis_Kischka</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td>Ralph Smart</td>\n","      <td>http://fr.dbpedia.org/resource/Ralph_Smart</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Ralph_Smart</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>10</th>\n","      <td>Robert Ardrey</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Ardrey</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Ardrey</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>11</th>\n","      <td>Paul Coremans</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_B._Coremans</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_B._Coremans</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>12</th>\n","      <td>Alan Baxter</td>\n","      <td>http://fr.dbpedia.org/resource/Alan_Baxter</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Alan_Baxter</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>13</th>\n","      <td>Raymond Cornon</td>\n","      <td>http://fr.dbpedia.org/resource/Raymond_Cornon</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Raymond_Cornon</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>14</th>\n","      <td>Šmaryahw Qačerginsqi</td>\n","      <td>http://fr.dbpedia.org/resource/Shmerke_Kaczerginski</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Shmerke_Kaczerginski</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>15</th>\n","      <td>Sadako Sawamura</td>\n","      <td>http://fr.dbpedia.org/resource/Sadako_Sawamura</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Sadako_Sawamura</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>16</th>\n","      <td>Winston Graham</td>\n","      <td>http://fr.dbpedia.org/resource/Winston_Graham</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Winston_Graham</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>17</th>\n","      <td>Mariâ Sergeevna Petrovyh</td>\n","      <td>http://fr.dbpedia.org/resource/Maria_Petrovikh</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Maria_Petrovikh</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>18</th>\n","      <td>Jean Sabran</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Berna</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Paul_Berna</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>19</th>\n","      <td>Lew Ayres</td>\n","      <td>http://fr.dbpedia.org/resource/Lew_Ayres</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Lew_Ayres</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>20</th>\n","      <td>Peter de Mendelssohn</td>\n","      <td>http://fr.dbpedia.org/resource/Peter_de_Mendelssohn</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Peter_de_Mendelssohn</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>21</th>\n","      <td>Frank Edwards</td>\n","      <td>http://fr.dbpedia.org/resource/Frank_Edwards</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Frank_Edwards</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>22</th>\n","      <td>Paul Georges Koch</td>\n","      <td>http://fr.dbpedia.org/resource/Paul-Georges_Koch</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Paul-Georges_Koch</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>23</th>\n","      <td>Nils Johan Rud</td>\n","      <td>http://fr.dbpedia.org/resource/Nils_Johan_Rud</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Nils_Johan_Rud</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>24</th>\n","      <td>Germaine Lacaze</td>\n","      <td>http://fr.dbpedia.org/resource/Germaine_Lacaze</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Germaine_Lacaze</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>25</th>\n","      <td>Richard Powell</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Powell</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Richard_Powell</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>26</th>\n","      <td>Hedda Morrison</td>\n","      <td>http://fr.dbpedia.org/resource/Hedda_Morrison</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Hedda_Morrison</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>27</th>\n","      <td>Cecil Collins</td>\n","      <td>http://fr.dbpedia.org/resource/Cecil_Collins</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Cecil_Collins</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>28</th>\n","      <td>Robert Hale Merriman</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Hale_Merriman</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Robert_Hale_Merriman</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>29</th>\n","      <td>Liselotte Grschebina</td>\n","      <td>http://fr.dbpedia.org/resource/Liselotte_Grschebina</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Liselotte_Grschebina</td>\n","      <td>1908</td>\n","    </tr>\n","    <tr>\n","      <th>30</th>\n","      <td>Ruby Elzy</td>\n","      <td>http://fr.dbpedia.org/resource/Ruby_Elzy</td>\n","      <td>1908</td>\n","      <td>http://fr.dbpedia.org/resource/Ruby_Elzy</td>\n","      <td>1908</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["                           nom  \\\n","0                  Harold Rome   \n","1               Georg Hurdalek   \n","2   Georgij Georgievič Demidov   \n","3              Richard Wormser   \n","4              Yvette Cauchois   \n","5              Vicente Asencio   \n","6              Robert Cummings   \n","7              Jean Jeanneteau   \n","8                 Isis Kischka   \n","9                  Ralph Smart   \n","10               Robert Ardrey   \n","11               Paul Coremans   \n","12                 Alan Baxter   \n","13              Raymond Cornon   \n","14       Šmaryahw Qačerginsqi   \n","15             Sadako Sawamura   \n","16              Winston Graham   \n","17    Mariâ Sergeevna Petrovyh   \n","18                 Jean Sabran   \n","19                   Lew Ayres   \n","20        Peter de Mendelssohn   \n","21               Frank Edwards   \n","22           Paul Georges Koch   \n","23              Nils Johan Rud   \n","24             Germaine Lacaze   \n","25              Richard Powell   \n","26              Hedda Morrison   \n","27               Cecil Collins   \n","28        Robert Hale Merriman   \n","29        Liselotte Grschebina   \n","30                   Ruby Elzy   \n","\n","                                          auteurDbpedia naissance_x  \\\n","0            http://fr.dbpedia.org/resource/Harold_Rome        1908   \n","1        http://fr.dbpedia.org/resource/George_Hurdalek        1908   \n","2       http://fr.dbpedia.org/resource/Gueorgui_Demidov        1908   \n","3        http://fr.dbpedia.org/resource/Richard_Wormser        1908   \n","4        http://fr.dbpedia.org/resource/Yvette_Cauchois        1908   \n","5        http://fr.dbpedia.org/resource/Vicente_Asencio        1908   \n","6        http://fr.dbpedia.org/resource/Robert_Cummings        1908   \n","7        http://fr.dbpedia.org/resource/Jean_Jeanneteau        1908   \n","8           http://fr.dbpedia.org/resource/Isis_Kischka        1908   \n","9            http://fr.dbpedia.org/resource/Ralph_Smart        1908   \n","10         http://fr.dbpedia.org/resource/Robert_Ardrey        1908   \n","11      http://fr.dbpedia.org/resource/Paul_B._Coremans        1908   \n","12           http://fr.dbpedia.org/resource/Alan_Baxter        1908   \n","13        http://fr.dbpedia.org/resource/Raymond_Cornon        1908   \n","14  http://fr.dbpedia.org/resource/Shmerke_Kaczerginski        1908   \n","15       http://fr.dbpedia.org/resource/Sadako_Sawamura        1908   \n","16        http://fr.dbpedia.org/resource/Winston_Graham        1908   \n","17       http://fr.dbpedia.org/resource/Maria_Petrovikh        1908   \n","18            http://fr.dbpedia.org/resource/Paul_Berna        1908   \n","19             http://fr.dbpedia.org/resource/Lew_Ayres        1908   \n","20  http://fr.dbpedia.org/resource/Peter_de_Mendelssohn        1908   \n","21         http://fr.dbpedia.org/resource/Frank_Edwards        1908   \n","22     http://fr.dbpedia.org/resource/Paul-Georges_Koch        1908   \n","23        http://fr.dbpedia.org/resource/Nils_Johan_Rud        1908   \n","24       http://fr.dbpedia.org/resource/Germaine_Lacaze        1908   \n","25        http://fr.dbpedia.org/resource/Richard_Powell        1908   \n","26        http://fr.dbpedia.org/resource/Hedda_Morrison        1908   \n","27         http://fr.dbpedia.org/resource/Cecil_Collins        1908   \n","28  http://fr.dbpedia.org/resource/Robert_Hale_Merriman        1908   \n","29  http://fr.dbpedia.org/resource/Liselotte_Grschebina        1908   \n","30             http://fr.dbpedia.org/resource/Ruby_Elzy        1908   \n","\n","                                                      p naissance_y  \n","0            http://fr.dbpedia.org/resource/Harold_Rome        1908  \n","1        http://fr.dbpedia.org/resource/George_Hurdalek        1908  \n","2       http://fr.dbpedia.org/resource/Gueorgui_Demidov        1908  \n","3        http://fr.dbpedia.org/resource/Richard_Wormser        1908  \n","4        http://fr.dbpedia.org/resource/Yvette_Cauchois        1908  \n","5        http://fr.dbpedia.org/resource/Vicente_Asencio        1908  \n","6        http://fr.dbpedia.org/resource/Robert_Cummings        1908  \n","7        http://fr.dbpedia.org/resource/Jean_Jeanneteau        1908  \n","8           http://fr.dbpedia.org/resource/Isis_Kischka        1908  \n","9            http://fr.dbpedia.org/resource/Ralph_Smart        1908  \n","10         http://fr.dbpedia.org/resource/Robert_Ardrey        1908  \n","11      http://fr.dbpedia.org/resource/Paul_B._Coremans        1908  \n","12           http://fr.dbpedia.org/resource/Alan_Baxter        1908  \n","13        http://fr.dbpedia.org/resource/Raymond_Cornon        1908  \n","14  http://fr.dbpedia.org/resource/Shmerke_Kaczerginski        1908  \n","15       http://fr.dbpedia.org/resource/Sadako_Sawamura        1908  \n","16        http://fr.dbpedia.org/resource/Winston_Graham        1908  \n","17       http://fr.dbpedia.org/resource/Maria_Petrovikh        1908  \n","18            http://fr.dbpedia.org/resource/Paul_Berna        1908  \n","19             http://fr.dbpedia.org/resource/Lew_Ayres        1908  \n","20  http://fr.dbpedia.org/resource/Peter_de_Mendelssohn        1908  \n","21         http://fr.dbpedia.org/resource/Frank_Edwards        1908  \n","22     http://fr.dbpedia.org/resource/Paul-Georges_Koch        1908  \n","23        http://fr.dbpedia.org/resource/Nils_Johan_Rud        1908  \n","24       http://fr.dbpedia.org/resource/Germaine_Lacaze        1908  \n","25        http://fr.dbpedia.org/resource/Richard_Powell        1908  \n","26        http://fr.dbpedia.org/resource/Hedda_Morrison        1908  \n","27         http://fr.dbpedia.org/resource/Cecil_Collins        1908  \n","28  http://fr.dbpedia.org/resource/Robert_Hale_Merriman        1908  \n","29  http://fr.dbpedia.org/resource/Liselotte_Grschebina        1908  \n","30             http://fr.dbpedia.org/resource/Ruby_Elzy        1908  "]},"execution_count":129,"metadata":{},"output_type":"execute_result"}],"source":["df1.merge(df2, left_on=\"auteurDbpedia\", right_on=\"p\")"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"JlhisyTGGtZ0"},"source":["### J3 : Quels sont les auteurs d'une oeuvre dont le thème est philosophie (dans la BNF) et qui sont référencés comme étant des philosophes dans DBpedia ?\n"]},{"cell_type":"code","execution_count":22,"metadata":{"executionInfo":{"elapsed":5,"status":"ok","timestamp":1682059009219,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"2UOmwMuJ7BN2"},"outputs":[],"source":["# A compléter\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"IfWr1BEYrt-M"},"source":["# Exercice 2 : Accès aux données par des requêtes de sélections\n","\n","L'objectif de cet exercice est d'appréhender la situation où l'accès aux données est contraint (voir la notion de [linked data fragment](https://linkeddatafragments.org/concept/)). Le point d'accès n'autorise que des requêtes simples (donc peut coûteuses à traiter) qui ne contiennent que des **sélections**. La clause where d'une requête ne peut contenir qu'**un seul** motif ayant 1 ou 2 variables. Les motifs autorisés sont donc parmi :\n","\n","- ?a _propriété_ ?b _(cette requête a deux variables)_\n","- _A_ _propriété_ ?b _(cette requête a une seule variable)_\n","- ?a _propriété_ _B_\n","\n","où ?a et ?b sont des variables et _A_, _B_ et _propriété_ sont des valeurs fixées avant de poser la requête.\n","\n","Ainsi, toutes les jointures doivent être exprimées par le client qui accède aux données : vous devez \"programmer\" toutes les jointures en python.\n","Pour les requêtes D1 et D6 proposer une solution respectant ce mode d'accès.\n"]},{"cell_type":"code","execution_count":23,"metadata":{"executionInfo":{"elapsed":3,"status":"ok","timestamp":1682059009445,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"leYOriLyOBnb"},"outputs":[],"source":["# à compléter\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"Mh8Nx-7nH_Jg"},"source":["# Exercice 3 : Accès par morceau au résultat d'une requête\n","\n","1. Un utilisateur veut accéder aux données de manière progressive. Proposer une solution pour obtenir le resultat d'une requete par morceau de N tuples, en utilisant les mots-clés OFFSET et LIMIT. Appliquer cela pour lire le résultat de la requête qui affiche le nom des personnes existant dans dbpedia.\n","   Etudier l'influence de l'offset et de la taille du résultat sur le temps de réponse de la requête.\n"]},{"cell_type":"code","execution_count":24,"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":415},"executionInfo":{"elapsed":325,"status":"ok","timestamp":1682059009767,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"_CH0X6N4634a","outputId":"94882d08-6a29-4f7a-d4ea-9f4f06be1181"},"outputs":[{"name":"stdout","output_type":"stream","text":["la requête dure 309 ms\n","10 éléments\n","schéma:  ['name', 'p']\n"]},{"data":{"text/html":["\n","  <div id=\"df-9552a241-8f50-4785-9fa2-98cc8e879753\">\n","    <div class=\"colab-df-container\">\n","      <div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>name</th>\n","      <th>p</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Galipeault</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Antonin Galipeault</td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Galipeault</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Gourju</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Antonin Gourju</td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Gourju</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Gros</td>\n","    </tr>\n","    <tr>\n","      <th>5</th>\n","      <td>Antonin Gros</td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Gros</td>\n","    </tr>\n","    <tr>\n","      <th>6</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Guigonnat</td>\n","    </tr>\n","    <tr>\n","      <th>7</th>\n","      <td>Antonin Guigonnat</td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Guigonnat</td>\n","    </tr>\n","    <tr>\n","      <th>8</th>\n","      <td>Antonin Lecouteux</td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Lecouteux</td>\n","    </tr>\n","    <tr>\n","      <th>9</th>\n","      <td></td>\n","      <td>http://fr.dbpedia.org/resource/Antonin_Louchard</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>\n","      <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-9552a241-8f50-4785-9fa2-98cc8e879753')\"\n","              title=\"Convert this dataframe to an interactive table.\"\n","              style=\"display:none;\">\n","        \n","  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n","       width=\"24px\">\n","    <path d=\"M0 0h24v24H0V0z\" fill=\"none\"/>\n","    <path d=\"M18.56 5.44l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94zm-11 1L8.5 8.5l.94-2.06 2.06-.94-2.06-.94L8.5 2.5l-.94 2.06-2.06.94zm10 10l.94 2.06.94-2.06 2.06-.94-2.06-.94-.94-2.06-.94 2.06-2.06.94z\"/><path d=\"M17.41 7.96l-1.37-1.37c-.4-.4-.92-.59-1.43-.59-.52 0-1.04.2-1.43.59L10.3 9.45l-7.72 7.72c-.78.78-.78 2.05 0 2.83L4 21.41c.39.39.9.59 1.41.59.51 0 1.02-.2 1.41-.59l7.78-7.78 2.81-2.81c.8-.78.8-2.07 0-2.86zM5.41 20L4 18.59l7.72-7.72 1.47 1.35L5.41 20z\"/>\n","  </svg>\n","      </button>\n","      \n","  <style>\n","    .colab-df-container {\n","      display:flex;\n","      flex-wrap:wrap;\n","      gap: 12px;\n","    }\n","\n","    .colab-df-convert {\n","      background-color: #E8F0FE;\n","      border: none;\n","      border-radius: 50%;\n","      cursor: pointer;\n","      display: none;\n","      fill: #1967D2;\n","      height: 32px;\n","      padding: 0 0 0 0;\n","      width: 32px;\n","    }\n","\n","    .colab-df-convert:hover {\n","      background-color: #E2EBFA;\n","      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n","      fill: #174EA6;\n","    }\n","\n","    [theme=dark] .colab-df-convert {\n","      background-color: #3B4455;\n","      fill: #D2E3FC;\n","    }\n","\n","    [theme=dark] .colab-df-convert:hover {\n","      background-color: #434B5C;\n","      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n","      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n","      fill: #FFFFFF;\n","    }\n","  </style>\n","\n","      <script>\n","        const buttonEl =\n","          document.querySelector('#df-9552a241-8f50-4785-9fa2-98cc8e879753 button.colab-df-convert');\n","        buttonEl.style.display =\n","          google.colab.kernel.accessAllowed ? 'block' : 'none';\n","\n","        async function convertToInteractive(key) {\n","          const element = document.querySelector('#df-9552a241-8f50-4785-9fa2-98cc8e879753');\n","          const dataTable =\n","            await google.colab.kernel.invokeFunction('convertToInteractive',\n","                                                     [key], {});\n","          if (!dataTable) return;\n","\n","          const docLinkHtml = 'Like what you see? Visit the ' +\n","            '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n","            + ' to learn more about interactive tables.';\n","          element.innerHTML = '';\n","          dataTable['output_type'] = 'display_data';\n","          await google.colab.output.renderOutput(dataTable, element);\n","          const docLink = document.createElement('div');\n","          docLink.innerHTML = docLinkHtml;\n","          element.appendChild(docLink);\n","        }\n","      </script>\n","    </div>\n","  </div>\n","  "],"text/plain":["                 name                                                  p\n","0                      http://fr.dbpedia.org/resource/Antonin_Galipeault\n","1  Antonin Galipeault  http://fr.dbpedia.org/resource/Antonin_Galipeault\n","2                          http://fr.dbpedia.org/resource/Antonin_Gourju\n","3      Antonin Gourju      http://fr.dbpedia.org/resource/Antonin_Gourju\n","4                            http://fr.dbpedia.org/resource/Antonin_Gros\n","5        Antonin Gros        http://fr.dbpedia.org/resource/Antonin_Gros\n","6                       http://fr.dbpedia.org/resource/Antonin_Guigonnat\n","7   Antonin Guigonnat   http://fr.dbpedia.org/resource/Antonin_Guigonnat\n","8   Antonin Lecouteux   http://fr.dbpedia.org/resource/Antonin_Lecouteux\n","9                        http://fr.dbpedia.org/resource/Antonin_Louchard"]},"execution_count":24,"metadata":{},"output_type":"execute_result"}],"source":["# Exemple d'utilisation de OFFSET et LIMIT\n","\n","# Compléter cet exemple\n","\n","\n","import time\n","\n","requete = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","\n","SELECT distinct ?name ?p \n","WHERE { \n","  ?p rdf:type dbo:Person .\n","  ?p foaf:name ?name\n","}\n","offset 33000 limit 10\n","\"\"\"\n",")\n","\n","start_time = time.time()\n","# exécution de la requête\n","DBPEDIA.setQuery(requete)\n","res = DBPEDIA.query().bindings\n","duree = int((time.time() - start_time) * 1000)\n","print(f\"la requête dure {duree} ms\")\n","\n","afficherResultat(res)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"aG1nFEdcmuJp"},"source":["2. Définir une fonction traiteRequete(requete) qui retourne un generateur sur une requete de telle sorte que la requete soit lue par morceaux de N tuples et que seuls les morceaux permettant de produire les M lignes demandées par l'utlisateur soit lus. On ne connait pas à l'avance le nombre M de lignes que va lire l'utilisateur. On a M > N.\n","   Indication voir le mot clé python **yield** pour retourner un générateur.\n"]},{"cell_type":"code","execution_count":25,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":783,"status":"ok","timestamp":1682059010546,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"1Bsz18LDn1yI","outputId":"f62e3538-ba05-4505-be74-0dbc9105d7ec"},"outputs":[{"name":"stdout","output_type":"stream","text":["leture d'un morceau de 10 lignes\n","{'name': Value(literal:''), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Bujko')}\n","{'name': Value(literal:'Łukasz Bujko'), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Bujko')}\n","{'name': Value(literal:''), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Gibała')}\n","{'name': Value(literal:'Łukasz Gibała'), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Gibała')}\n","{'name': Value(literal:''), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Gierak')}\n","{'name': Value(literal:'Gierak'), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Gierak')}\n","{'name': Value(literal:''), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Grzeszczuk')}\n","{'name': Value(literal:'Łukasz Grzeszczuk'), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Grzeszczuk')}\n","{'name': Value(literal:''), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Kaczmarek')}\n","{'name': Value(literal:'Łukasz Kaczmarek'), 'p': Value(uri:'http://fr.dbpedia.org/resource/Łukasz_Kaczmarek')}\n","\n","Attention !!!! l'utilisateur n'a obtenu que 10 lignes sur les 20\n"]}],"source":["requete = (\n","    DBPEDIA_prefix\n","    + \"\"\"\n","SELECT distinct ?name ?p \n","WHERE { \n","  ?p rdf:type dbo:Person .\n","  ?p foaf:name ?name\n","}\n","offset 0 limit 10\n","\"\"\"\n",")\n","\n","\n","# définition d'un générateur\n","def traiteRequete(requete):\n","    DBPEDIA.setQuery(requete)\n","    res = DBPEDIA.query().bindings\n","    print(f\"leture d'un morceau de {len(res)} lignes\")\n","    for r in res:\n","        yield r\n","\n","\n","# Nombre de tuples que l'utilisateur souhaite lire\n","a_lire = 20\n","\n","lu = 0\n","for a in traiteRequete(requete):\n","    print(a)\n","    lu += 1\n","    if lu >= a_lire:\n","        break\n","\n","print()\n","if lu < a_lire:\n","    print(f\"Attention !!!! l'utilisateur n'a obtenu que {lu} lignes sur les {a_lire}\")\n","else:\n","    print(f\"OK, l'utilisateur a obtenu {lu} lignes sur les {a_lire}\")\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"upK5LQIBkgnD"},"source":["3. Proposer une solution pour accéder de manière progressive au résultat d'une requête répartie entre 2 sites, par exemple J1.\n"]},{"cell_type":"code","execution_count":26,"metadata":{"executionInfo":{"elapsed":8,"status":"ok","timestamp":1682059010547,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"q3d3CmdPuI6b"},"outputs":[],"source":["# à compléter\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"_a2Wt3ryG_ii"},"source":["# Exerice 4 : Cache de requêtes\n","\n","1. Proposer des améliorations des requêtes précédentes afin d'éviter de poser plusieurs fois une même requête. On suppose que le résultat de la requête ne change pas entre deux invocations de la même requête.\n","\n","2. Cache avec une capacité limitée : considérer qu'on peut conserver en cache le résultat de C requêtes (C=10) au maximum\n"]},{"cell_type":"code","execution_count":27,"metadata":{"executionInfo":{"elapsed":8,"status":"ok","timestamp":1682059010547,"user":{"displayName":"Hubert Naacke","userId":"03575281438400116050"},"user_tz":-120},"id":"hcuUAhRWHg2a"},"outputs":[],"source":["# A compléter\n"]},{"cell_type":"markdown","metadata":{"id":"zo_g0AzJKVYF"},"source":["# FAQ: Questions diverses\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"p4SmE1c7t_cZ"},"source":["## Mise au point des requêtes\n","\n","Pour débugguer et **mettre au point vos requêtes** Sparql, il est utile de les tester directement sur l'interface du point d'accès dédié de la source de données. L'avantage est que cela vous retourne un message indiquant très précisément la nature et l'endroit où se trouve l'erreur dans la requête.\n","\n","- [BNF](http://data.bnf.fr/sparql) voir des [exemples](https://api.bnf.fr/sparql-endpoint-de-databnffr)\n","- [DBPedia](http://fr.dbpedia.org/sparql) et la liste de tous les [prefixes](http://fr.dbpedia.org/sparql?nsdecl)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"5oiLbGDiPySC"},"source":["## Autres sources de données\n","\n","Autres sources à votre disposition pour proposer des requêtes multi-sources:\n","\n","1.  [Mondial](http://www.semwebtech.org/mondial/10/sparql) : données géopolitiques. Attention le résulat des requêtes est en XML pas en JSON.\n","2.  [Persée](data.persee.fr) : données bibliographiques alignées avec plusieurs autres sources dont dbpedia. Voir des [exemples](http://data.persee.fr/ressources/requetes-exemples/)\n","3.  [BioPortal](http://sparql.bioontology.org)\n","4.  [IdRef](https://data.idref.fr/sparql) serveur d’autorité IdRef et les références bibliographiques en provenance du Sudoc.\n","5.  [Insee](https://rdf.insee.fr/sparql)\n","6.  [Geonames web services](https://www.geonames.org/export/ws-overview.html)\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"VgX2uwT3QE1R"},"source":["## SPARKLIS : aide à l'écriture de requêtes Sparql\n","\n","Pour exprimer vos requêtes en _langage naturel_ et les traduire automatiquement en SPARQL, voir l'appli [Sparklis](http://www.irisa.fr/LIS/ferre/sparklis/)\n","\n","- onglet **Sparklis** pour exprimer vos requêtes en langage naturel\n","- onglet **YASGUI** pour voir la traduction en Sparql\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"WmDBH2A6Ja0H"},"source":["## Nombre d'éléments dans le resultat d'une requête\n","\n","Pour compter le nombre d'éléments d'une requête, utiliser la notation avec requête imbriquée dans le where :\n","\n","SELECT (count(1) as ?nb)\n","\n","WHERE { _sous-requete_ }\n"]}],"metadata":{"colab":{"authorship_tag":"ABX9TyP5YXwP7WfClWr0cR4sJJYc","provenance":[],"toc_visible":true},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"name":"python"}},"nbformat":4,"nbformat_minor":0}
